# *************** HOMEWORK 1 ***************

# **************************************************************
# ************************ QUESTION 1 **************************
def question1(a, b, c):
    if (b**2 - 4*a*c) > 0: # בודק האם המשוואה גדולה מאפס ואם כן מדפיס 2
        print(2)
    elif (b**2 - 4*a*c) == 0: # בודק אם המשוואה שווה לאפס ואם כן מדפיס 1
        print(1)
    else: # אם שניהם יצאו לא נכונים אין פתרונות ולכן ידפיס  0
        print(0)

# **************************************************************
# ************************ QUESTION 2 **************************
def question2(date):
    day = date % 100 # משתנה ששומר את היום
    month = (int(date / 100)) % 100 # משתנה ששומר את החודש
    year = int(date / 10000) # משתנה ששומר את השנה
    if year > 2020: # אם השנה גדולה מאלפיים עשרים מדפיס לא נכון אם השנה נמוכנה ממשיף
        print("invalid")
    elif (month <= 12) and (month > 0): # בודק תקינות של חודש
        if month == 2: # בודק אם החודש הוא פברואר
            if year % 4 == 0: # בודק אם השנה היא מעוברת
                if (day < 0) or (day > 29): # תקינות יום לשנה מעוברת בחודש פברואר
                    print("invalid")
                else:
                    print("valid")
            else:
                if (day < 0) or (day > 28): # תקינות יום לשנה לא מעוברת
                    print("invalid")
                else:
                    print("valid")
        elif (month == 1) or (month == 3) or (month == 5) or (month == 7) or (month ==8) or (month == 10) or (month == 12):
            if (day < 0) or (day > 31): # תקינוץ ליום לחודשים בעלי 31 יום
                print("invalid")
            else:
                print("valid")
        else:
            if (day < 0) or (day > 30): # בודק תקינות יום לחודשי של 30 ימים
                print("invalid")
            else:
                print("valid")

# **************************************************************
# ************************ QUESTION 3 **************************
def question3(s):
    temp = "" # משתנה שישמור את המחרוזת הסופית
    for i in range(len(s)): # לולאה שבודקת אם הערך של תו הוא מספר ואם לא אז מוסיפה אותו לטמפ
        if not s[i].isdigit():
            temp += "" + s[i]
        else:
            break
    print(temp)  # הדפסה של התוצר הסופי


# **************************************************************
# ************************ QUESTION 4 **************************
def question4(input_list):
    index_out = 0 # שומר את האינדקס של המספר שהוציא אותנו
    Sum = 0 # המשתנה של הסכום
    for i in range(len(input_list)-1):
        if input_list[i] >= input_list[i+1]: # האם האיבר גדול או שווה לאיבר שאחריו אם כן נכנס
            if input_list[i] % 3 == 0: # האם המספר מתחלק ב 3 ללא שארית
                Sum += input_list[i]
        else:
            index_out = i+1 # האינדקס של המספר שהוציא
            Sum = 0 # איפוס הסכום
            break
    if index_out != 0: # לולאה לחיושב כל המספרים ברשימה עד למספר שהוציא לא כולל
        for i in range(index_out):
            Sum += input_list[i]
    print(Sum)



